%//////////////////////////////////////////////////////////////////////////
%//////////////////////////////////////////////////////////////////////////
%///////////////////////////Hamilton的对角化///////////////////////////////
%//////////////////////////////////////////////////////////////////////////
%//////////////////////////////////////////////////////////////////////////
N=10;
%//////////////////////////////////////////////////////////////////////////
%Lz本征值s1和s2    对于奇数项s(i)=s1    对于偶数项s(i)=s2
Lz=0;
s1=1;
s2=Lz-s1;
s=(1:N);
for i=1:N
      if 0==mod(i,2)
          s(i)=s2;
      else
          s(i)=s1;
      end
end
%//////////////////////////////////////////////////////////////////////////
%Dvalue为差分间隔
%x为自变量
Dvalue=1;
x=(1:N);
for i=2:N
      x(i)=x(i-1)+Dvalue;
end
%//////////////////////////////////////////////////////////////////////////
%n为总的角量子数  n1为态1的角量子数  n2为态2的角量子数
n=1;
n1=1/2;
n2=n-n1;
%//////////////////////////////////////////////////////////////////////////
%差分间隔
dL=1/N;
%//////////////////////////////////////////////////////////////////////////
%求和运算说明
%//////////////////////////////////////////////////////////////////////////
%syms n;                       %定义一个求和运算 自变量为n
%symsum(1/n,n,1,100);          %第一项为运算通项，第二项为自变量通项，
%                              %第三、四项为 从 三项设定值 求和到 四项设定值
m_max=3;
syms k; 

%//////////////////////////////////////////////////////////////////////////
%//////////////////////////////////////////////////////////////////////////
w=1;
%I10为I1的强度  I20为I2的强度
I10=1;
I20=1;
I1=I10;
I2=I20;
%系数Xij：X1=X1a=可调系数,X2=X1bc=可调系数,X3=X2bc=可调系数,X4=X2d=可调系数
X1=1;
X2=1;
X3=1;
X4=1;
%态之间的耦合系数：StateC=(X1+X3)*I1+(X2+X4)*I2
StateC=(X1+X3)*I1+(X2+X4)*I2;
%Zeeman移动：ZeemanS=(X1-X3)*I1+(X2-X4)*I2
ZeemanS=(X1-X3)*I1+(X2-X4)*I2;
%two-photon detuning：PhotonD=E1-E2+(hw+)-(hw-)=可调系数
PhotonD=1;
%Rabi coupling项：RabiC=RabiC0*sqrt(I1*I2)
RabiC0=1;
RabiC=RabiC0*sqrt(I1*I2);
H=zeros(N,N);
for i=2:(N-1)
    for  m=1:m_max
      for  n=1:m
      %通项：the formula of general term
      %缩写：FOGT
      FOGT=(-1)^k*(1/(factorial(k)*factorial(m-k)*factorial(n+k)))*x(i)^k;
      Laguerre(m,n)=factorial(m+n)*symsum(FOGT,k,1,m);
      end
     end
     H(i,i)=4*x(i)/dL^2+(2*s(i)+2)/dL;
     H(i,i)=H(i,i)+1/2*((X1+X3)*I1*x(i)^n1+(X2+X4)*I2*x(i)^n2);
     H(i,i)=H(i,i)+(-1)^(i+1)*1/2*(PhotonD+(X1-X3)*I1*x(i)^n1+(X2-X4)*I2*x(i)^n2);
     H(i,i)=H(i,i)+1/2*w^2*x(i);
     H(i,i)=H(i,i)-2*x(i-1)/dL^2-(2*s(i)+2)/dL;
     H(i,i)=H(i,i)-2*x(i+1)/dL^2;
     H(i,i)=H(i,i)+RabiC*x(i)^(s(i+1)-s(i)+n1+n2);
end